api/app/controllers/api/blogs_controller.rb

SELECT `blogs`.* FROM `blogs` ORDER BY `blogs`.`created_at` DESC
---
  def index
    @blogs = Blog.filter(params).order(created_at: :desc)

SELECT `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 1 LIMIT 1
SELECT `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 6 AND `blogs`.`status` IS NULL LIMIT 1
---
  def show
    if params[:status].present?
      @blog = Blog.find_by(id: params[:id], status: params[:status])
    else
      @blog = Blog.find(params[:id])

UPDATE `blogs` SET `blogs`.`content` = '{\"blocks\":[{\"key\":\"459gl\",\"text\":\"Hello World.\",\"type\":\"header-one\",\"depth\":0,\"inlineStyleRanges\":[{\"offset\":6,\"length\":5,\"style\":\"ITALIC\"}],\"entityRanges\":[],\"data\":{}}],\"entityMap\":{}}', `blogs`.`updated_at` = '2020-04-12 20:12:38.344811' WHERE `blogs`.`id` = 11
---
  def create
    blog = Blog.find_or_initialize_by(id: params[:id])
    blog.update(blog_params)